; domain
;; logistics domain Typed version.

(define (domain logistics)
  (:requirements :strips :typing) 
  (:types city place physobj - object
          package vehicle - physobj
          truck airplane - vehicle
          airport location - place
  )
  (:predicates 
	(in-city ?loc - place ?city - city) 
	(at ?obj - physobj ?loc - place) 
	(in ?pkg - package ?veh - vehicle)
  )
  (:action LOAD-TRUCK
    :parameters (?pkg - package ?truck - truck ?loc - place)
    :precondition (and (at ?truck ?loc) (at ?pkg ?loc))
    :effect (and (not (at ?pkg ?loc)) (in ?pkg ?truck))
  )
  (:action LOAD-AIRPLANE
   :parameters (?pkg - package ?airplane - airplane ?loc - place)
   :precondition (and (at ?pkg ?loc) (at ?airplane ?loc))
   :effect (and (not (at ?pkg ?loc)) (in ?pkg ?airplane))
  )
  (:action UNLOAD-TRUCK
   :parameters (?pkg - package ?truck - truck ?loc - place)
   :precondition (and (at ?truck ?loc) (in ?pkg ?truck))
   :effect (and (not (in ?pkg ?truck)) (at ?pkg ?loc))
  )
  (:action UNLOAD-AIRPLANE
   :parameters (?pkg - package ?airplane - airplane ?loc - place)
   :precondition (and (in ?pkg ?airplane) (at ?airplane ?loc))
   :effect (and (not (in ?pkg ?airplane)) (at ?pkg ?loc))
  )
  (:action DRIVE-TRUCK
   :parameters (?truck - truck ?loc_from - place ?loc_to - place ?city - city)
   :precondition (and (not (= ?loc_from ?loc_to)) (at ?truck ?loc_from) (in-city ?loc_from ?city) (in-city ?loc_to ?city))
   :effect (and (not (at ?truck ?loc_from)) (at ?truck ?loc_to))
  )
  (:action FLY-AIRPLANE
   :parameters (?airplane - airplane ?loc_from - airport ?loc_to - airport)
   :precondition (and (not (= ?loc_from ?loc_to)) (at ?airplane ?loc_from))
   :effect (and (not (at ?airplane ?loc_from)) (at ?airplane ?loc_to))
  )
)

; problem
(define (problem TOY-LOGISTICS) (:domain logistics)
(:objects 
P - airplane 
T - truck 
cit1 cit2 - city
pkg1 pkg2 pkg3 pkg4 - package
loc1 loc2 - location
arp1 arp2 - airport
)

(:init
(in-city loc1 cit1) (in-city loc2 cit1) (in-city arp1 cit1) (in-city arp2 cit2)
(at pkg3 loc1) (at pkg2 arp1) (at pkg4 loc2) (at pkg1 arp2) 
(at T loc2) (at P arp2)
)

(:goal (and
(at pkg2 loc1) (at pkg1 loc2) (at pkg4 loc2) (at pkg3 arp2)
))

;un-comment the following line if metric is needed
;(:metric minimize (???))
)

; plan
1. (load-airplane pkg1 p arp2)
   deleted: (at pkg1 arp2)
   added: (in pkg1 p)
   goals met: 1 of 4
2. (drive-truck t loc2 loc1 cit1)
   deleted: (at t loc2)
   added: (at t loc1)
   goals met: 1 of 4
3. (load-truck pkg3 t loc1)
   deleted: (at pkg3 loc1)
   added: (in pkg3 t)
   goals met: 1 of 4
4. (drive-truck t loc1 arp1 cit1)
   deleted: (at t loc1)
   added: (at t arp1)
   goals met: 1 of 4
5. (load-truck pkg2 t arp1)
   deleted: (at pkg2 arp1)
   added: (in pkg2 t)
   goals met: 1 of 4
6. (unload-truck pkg3 t arp1)
   deleted: (in pkg3 t)
   added: (at pkg3 arp1)
   goals met: 1 of 4
7. (fly-airplane p arp2 arp1)
   deleted: (at p arp2)
   added: (at p arp1)
   goals met: 1 of 4
8. (load-airplane pkg3 p arp1)
   deleted: (at pkg3 arp1)
   added: (in pkg3 p)
   goals met: 1 of 4
9. (unload-airplane pkg1 p arp1)
   deleted: (in pkg1 p)
   added: (at pkg1 arp1)
   goals met: 1 of 4
10. (load-truck pkg1 t arp1)
   deleted: (at pkg1 arp1)
   added: (in pkg1 t)
   goals met: 1 of 4
11. (drive-truck t arp1 loc2 cit1)
   deleted: (at t arp1)
   added: (at t loc2)
   goals met: 1 of 4
12. (unload-truck pkg1 t loc2)
   deleted: (in pkg1 t)
   added: (at pkg1 loc2)
   goals met: 2 of 4
13. (drive-truck t loc2 loc1 cit1)
   deleted: (at t loc2)
   added: (at t loc1)
   goals met: 2 of 4
14. (unload-truck pkg2 t loc1)
   deleted: (in pkg2 t)
   added: (at pkg2 loc1)
   goals met: 3 of 4
15. (fly-airplane p arp1 arp2)
   deleted: (at p arp1)
   added: (at p arp2)
   goals met: 3 of 4
16. (unload-airplane pkg3 p arp2)
   deleted: (in pkg3 p)
   added: (at pkg3 arp2)
   goals met: 4 of 4
